org/lc-189-rotate-array.org
#+SETUPFILE: ./hugo_setup.org
#+TITLE: LC189. 旋转数组
#+DATE: <2021-10-23 Sat>
今天思考 LeetCode 题目：旋转数组[fn:1]。

* 题目描述

给定一个数组，将数组中的元素向右移动 =k= 个位置，其中 =k= 是非负数。

进阶：

- 尽可能想出更多的解决方案，至少有三种不同的方法可以解决这个问题。
- 能使用空间复杂度为 \(O(1)\) 的原地算法解决这个问题吗？

* 题解[fn:2]

#+begin_src js
  /**
   * @param {number[]} nums
   * @param {number} k
   * @return {void} Do not return anything, modify nums in-place instead.
   */
  var rotate = function(nums, k) {
      const n = nums.length;
      const newArr = new Array(n);
      for (let i = 0; i < n; ++i) {
          newArr[(i + k) % n] = nums[i];
      }
      for (let i = 0; i < n; ++i) {
          nums[i] = newArr[i];
      }
  };

  // console.log(rotate([1, 2, 3, 4, 5, 6, 7], 3));
#+end_src

不知道为什么，本地测试时显示 =undefined= 。

[fn:1] https://leetcode-cn.com/problems/rotate-array/

[fn:2] https://leetcode-cn.com/problems/rotate-array/solution/xuan-zhuan-shu-zu-by-leetcode-solution-nipk/