blog/2021/lc-189-rotate-array.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 12:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>LC189. 旋转数组</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">LC189. 旋转数组</h1>
</header><p>
今天思考 LeetCode 题目：旋转数组<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>。
</p>

<div id="outline-container-org50cf411" class="outline-2">
<h2 id="org50cf411">题目描述</h2>
<div class="outline-text-2" id="text-org50cf411">
<p>
给定一个数组，将数组中的元素向右移动 <code>k</code> 个位置，其中 <code>k</code> 是非负数。
</p>

<p>
进阶：
</p>

<ul class="org-ul">
<li>尽可能想出更多的解决方案，至少有三种不同的方法可以解决这个问题。</li>
<li>能使用空间复杂度为 \(O(1)\) 的原地算法解决这个问题吗？</li>
</ul>
</div>
</div>

<div id="outline-container-org07bd1dc" class="outline-2">
<h2 id="org07bd1dc">题解<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h2>
<div class="outline-text-2" id="text-org07bd1dc">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #7c7565;">/**</span>
<span style="color: #7c7565;"> * @param {number[]} nums</span>
<span style="color: #7c7565;"> * @param {number} k</span>
<span style="color: #7c7565;"> * @return {void} Do not return anything, modify nums in-place instead.</span>
<span style="color: #7c7565;"> */</span>
<span style="color: #91a0b3;">var</span> <span style="color: #aaca86;">rotate</span> = <span style="color: #91a0b3;">function</span>(<span style="color: #aaca86;">nums</span>, <span style="color: #aaca86;">k</span>) {
    <span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">n</span> = nums.length;
    <span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">newArr</span> = <span style="color: #91a0b3;">new</span> <span style="color: #ad8572;">Array</span>(n);
    <span style="color: #91a0b3;">for</span> (<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">i</span> = 0; i &lt; n; ++i) {
        newArr[(i + k) % n] = nums[i];
    }
    <span style="color: #91a0b3;">for</span> (<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">i</span> = 0; i &lt; n; ++i) {
        nums[i] = newArr[i];
    }
};

<span style="color: #706565;">// </span><span style="color: #857575;">console.log(rotate([1, 2, 3, 4, 5, 6, 7], 3));</span>
</pre>
</div>

<p>
不知道为什么，本地测试时显示 <code>undefined</code> 。
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://leetcode-cn.com/problems/rotate-array/">https://leetcode-cn.com/problems/rotate-array/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://leetcode-cn.com/problems/rotate-array/solution/xuan-zhuan-shu-zu-by-leetcode-solution-nipk/">https://leetcode-cn.com/problems/rotate-array/solution/xuan-zhuan-shu-zu-by-leetcode-solution-nipk/</a></p></div></div>


</div>
</div></div>
</body>
</html>